### 1. La Base

#### 1.1 Simple échange (1 pts)

In [1]:
A = 10 
B = 20
A, B = B, A
print ("La valeur de A est: ",A)
print ("La valeur de B est: ",B)

La valeur de A est:  20
La valeur de B est:  10

#### 1.2 Le carré (1 pts)

In [ ]:
variable = int(input("Entrez un nombre : "))
carre = variable * variable
print (carre)

#### 1.3  La condition (1.5 pts)

In [ ]:
variable = int(input("Entrez un nombre : "))
if variable <0:
    print ("Le nombre est négatif")
if variable >0:
    print ("Le nombre est positif")

#### 1.4  Le produit (2 pts)

In [ ]:
variable1 = int(input("Entrez un premier nombre : "))
variable2 = int(input("Entrez un deuxième nombre : "))
if variable1 < 0 and variable2 >0 or variable1 > 0 and variable2 <0:
    print("Le produit est négatif")
else:
    print("Le produit est positif")

#### 1.5 Calcul (2 pts)

In [ ]:
variable = int(input("Entrez un nombre de départ: "))
step=1
while step<=10:
    print(step+variable)
    step=step+1

#### 1.6 Additivité (2.5 pts)

In [5]:
variable = int(input("Entrez un nombre : "))
i=0 
somme =0
while i<= variable:
    somme=somme+i
    i=i+1
    
print (somme)

Entrez un nombre : 5
15

### 2. Pandas (10 points)

#### 2.1 Ouvrir et stocker un CSV (3 points)

In [24]:
import pandas as pd
import math
import numpy as np

#Lire le fichier csv
df=pd.read_csv("Pandas_exercice.csv", sep=",")
df.head()

   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  05-10-2012         3001         5002
1   70009     270.65  09-10-2012         3001         5005
2   70002      65.26  05-10-2012         3005         5001
3   70004     110.50  06-10-2012         3001         5003
4   70007     948.50  10-09-2012         3005         5002

In [17]:
#Afficher le max de chaque colonne: Méthode avec une boucle 
for i in df.columns:
    print(df[i].max())

70013
5760.0
17-06-2012
3005
5007

In [18]:
#Afficher le max de chaque colonne: Méthode avec describe
# le maximum de chaque colonne est donné dans la dernière ligne
df.describe()

             ord_no    purch_amt  customer_id  salesman_id
count     12.000000    12.000000    12.000000    12.000000
mean   70007.083333  1461.765000  3003.000000  5002.833333
std        4.055486  1751.411698     2.088932     2.081666
min    70001.000000    65.260000  3001.000000  5001.000000
25%    70003.750000   140.500000  3001.000000  5001.000000
50%    70007.500000   609.575000  3003.000000  5002.000000
75%    70010.250000  2420.550000  3005.000000  5003.500000
max    70013.000000  5760.000000  3005.000000  5007.000000

#### 2.2 Grouper et afficher (3 points)

In [21]:
# Créer une fonction qui permet de calculer le total de la variable purch_amt par customer_id.
def total_var(colonne):
    return df[colonne].groupby(df['customer_id']).sum()

total_var('purch_amt')

customer_id
3001     5166.13
3005    12375.05
Name: purch_amt, dtype: float64

#### 2.3 Trier et modifier (4 points)

In [34]:
#Afficher le dataframe trié par purch_amt (de manière décroissante)
df_triee= df.sort_values(by='purch_amt', ascending=False)

# remplacer les montant inférieurs à 300 par une valeur NaN.

for i in df_triee['purch_amt']:
    if i<300:
        df_triee=df_triee.replace(i, np.nan)

In [42]:
df_triee

    ord_no  purch_amt    ord_date  customer_id  salesman_id
6    70008    5760.00  10-09-2012         3005         5001
11   70013    3045.60  08-08-2012         3005         5001
8    70003    2480.40  10-10-2012         3005         5003
5    70005    2400.60  10-09-2012         3001         5001
7    70010    1983.43  10-10-2012         3001         5006
4    70007     948.50  10-09-2012         3005         5002
0    70001        NaN  05-10-2012         3001         5002
1    70009        NaN  09-10-2012         3001         5005
2    70002        NaN  05-10-2012         3005         5001
3    70004        NaN  06-10-2012         3001         5003
9    70012        NaN  17-06-2012         3001         5002
10   70011        NaN  07-08-2012         3005         5007